Revit 2027 API
CurveByPointsUtils Methods
The CurveByPointsUtils type exposes the following members.
Methods
Name | Description
AddCurvesToFaceRegion |  Adds The CurveElements to one or more FaceRegions.
CreateArcThroughPoints |  Creates an arc through the given reference points.
CreateRectangle |  Creates rectangle on face or sketchplane for two given diagonal points.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFaceRegions |  Gets the FaceRegions in the existing face.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetHostFace |  Gets the host face to which the CurveElement is added.
GetProjectionType |  Gets the projection type of the CurveElement.
GetSketchOnSurface |  Gets the relationship between the CurveElement and face.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetProjectionType |  Sets the projection type of the CurveElement.
SetSketchOnSurface |  Sets the relationship between the CurveElement and face.
ToString | Returns a string that represents the current object.
(Inherited from Object)
ValidateCurveElementIdArrayForFaceRegions |  Validates that the input CurveElements can define FaceRegions. The CurveElements must be CurveByPoints. Each curve must be entirely hosted by a single Face or hosts related to a common Face (for example, Edges of a common Face, other CurveElements hosted by a common Face). To be added to the FaceRegion definition, a CurveElement must have the SketchOnSurface attribute set.
Top
See Also
Reference
CurveByPointsUtils Class
Autodesk.Revit.DB Namespace